# StairsLandingtypeUseSameTriserAsRun Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsLandingtypeUseSameTriserAsRun Property
ParameterTypeId Class See Also
---
"Same as Run": Same as Run
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsLandingtypeUseSameTriserAsRun { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsLandingtypeUseSameTriserAsRun As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsLandingtypeUseSameTriserAsRun {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace